#### WaterLoopType Enumeration

---

|  |
| --- |
| See Also |

The type of water loop.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum WaterLoopType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration WaterLoopType ``` |

| Visual C++ |
| --- |
| ``` public enum class WaterLoopType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined |  |
| ChilledWater |  |
| CondenserWater |  |
| HotWater |  |
| VRF |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace